app/views/students/index.html.erb

  <div>
    <%= link_to student.name, house_student_path(student.house, student) %> - <%= House.find(student.house).name %>
---
SELECT "houses".* FROM "houses" WHERE "houses"."id" = $1 ORDER BY "houses"."id" ASC LIMIT 1  [["id", 1]]