app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."house_id" = $1 AND "students"."id" = $2 LIMIT 1  [["house_id", 1], ["id", "3"]]
---
  def show
  	@house = House.find(params[:house_id])
    @student = @house.students.find(params[:id])